Repository: V1taS/oChat
Catalog: oChat/App/Sources/Modules/MessengerListScreenModule/Localization/*.lproj/MessengerListScreenModuleLocalization.strings
Languages: ru

# State.Notification.PasscodeNotSet.Title
source: Passcode not set on the device. Data encryption is not possible!
ru: Пароль на устройстве не установлен. Шифрование данных невозможно!

# State.Banner.PushNotification.Title
source: When you are offline, messages cannot be delivered. However, with the 'Notify Contact' feature, your friends can let you know they want to chat. To enable this feature, please allow Push notifications.
ru: Когда вы офлайн, сообщения не могут быть доставлены. Однако, с функцией 'Позвать контакт' ваши друзья смогут уведомить вас о желании пообщаться. Для активации этой функции, пожалуйста, разрешите Push-уведомления.

# LocalNotification.Title
source: New Message
ru: Новое сообщение

# LocalNotification.Body
source: You have a new chat message from
ru: У вас есть новое сообщение в чате от

# Notification.FailedCreatePublicKey.Title
source: Failed to create Public Key for encryption
ru: Не получилось создать Публичный ключ для шифрования

# Notification.IncorrectContactAddress.Title
source: Incorrect contact address
ru: Неправильный адрес контакта

# Notification.NoRecipientAddress.Title
source: No recipient address
ru: Нет адреса получателя

# Notification.PublicKeyMissing.Title
source: Public key missing
ru: Отсутствует публичный ключ

# Notification.ContactIsOffline.Title
source: Contact is offline
ru: Контакт не в сети

# Notification.ContactHasBeenDeleted.Title
source: Contact has been deleted
ru: Контакт был удален

# Notification.ErrorAddingContact.Title
source: Error adding contact
ru: Ошибка добавления контакта

# Message.SuccessfullyClearedAllChat.Title
source: You have successfully cleared the entire chat history
ru: Вы успешно очистили всю историю переписки

# BanScreenshot.Description
source: Taking a screenshot is not available
ru: Снимок экрана недоступен

# SwipeActions.Clear.Title
source: Clear
ru: Очистить

# SwipeActions.Delete.Title
source: Delete
ru: Удалить

# PushNotification.YouAreInvitedToChat.Title
source: You are invited to chat
ru: Вас зовут в чат

# PushNotification.YouAreInvitedToChat.Description
source: Your contact %@ wants to chat with you. Please join the chat.
ru: Ваш контакт %@ хочет с вами пообщаться. Пожалуйста, зайдите в чат.

# Demo.Contact1.Received.1
source: Hi! Have you heard about oChat? It's a treasure for paranoiacs! 😂
ru: Привет! Ты слышал про oChat? Это просто находка для параноиков! 😂

# Demo.Contact1.Own.1
source: Hi! Well, paranoia is our everything! What's so interesting about it?
ru: Привет! Ну, паранойя – наше всё! Что там такого интересного?

# Demo.Contact1.Received.2
source: They encrypt all messages on multiple levels! First ECIES, then AES-256, NaCl, and for key exchange, they use Curve25519 and XSalsa20. Almost like in spy movies! 🕵️‍♂️
ru: Они шифруют все сообщения на нескольких уровнях! Сначала ECIES, потом AES-256, NaCl, и для обмена ключами используют Curve25519 и XSalsa20. Почти как в шпионских фильмах! 🕵️‍♂️

# Demo.Contact1.Own.2
source: Wow! What if someone tries to tamper with the messages?
ru: Ух ты! А если кто-то попробует подделать сообщения?

# Demo.Contact1.Received.3
source: Not possible! They use Poly1305 for integrity check. It ensures no data is altered on the way. 🛡️
ru: Не получится! Для проверки целостности у них есть Poly1305. Он следит, чтобы никто не изменил данные по пути. 🛡️

# Demo.Contact1.Own.3
source: Wow, they are serious about security! Can you send me something secret to test?
ru: Ого, они явно не шутят с безопасностью! Можешь отправить мне что-то секретное для теста? 🤫

# Demo.Contact1.Received.4
source: Sure! Here's my grandma's pie recipe – just between us! 🥧
ru: Конечно! Вот тебе рецепт бабушкиного пирога – строго между нами! 🥧

# Demo.Contact1.Own.4
source: Delicious pie on a secret level – I'm in! 😂
ru: Вкусный пирог на секретном уровне – я в деле! 😂

# Demo.Contact2.Received.1
source: You won't believe it, but there's no backup in oChat! 😲
ru: Ты не поверишь, но в oChat вообще нет резервных копий! 😲

# Demo.Contact2.Own.1
source: Really? How does that work?
ru: Серьезно? Это как работает?

# Demo.Contact2.Received.2
source: All messages go directly. You can only chat when both contacts are online. No servers, no records! 📡
ru: Все сообщения идут напрямую. Ты можешь общаться только тогда, когда оба контакта в сети. Никаких серверов, никаких записей! 📡

# Demo.Contact2.Own.2
source: Sounds super secure! And if I'm offline, I won't receive any messages?
ru: Звучит супер безопасно! И что, если я не в сети, то никаких сообщений не получу?

# Demo.Contact2.Received.3
source: Exactly! But if you need to chat urgently, you can press the 'Call a Friend' button, and they'll get a push notification asking to join the chat. 📲
ru: Именно! Но если тебе нужно срочно поговорить, ты можешь нажать кнопку Позвать друга, и ему придет пуш-уведомление с просьбой войти в чат. 📲

# Demo.Contact2.Own.3
source: Oh, that's convenient! Now no one will know I'm discussing buying a new bike! 🚲
ru: О, это удобно! Теперь никто не сможет узнать, что я обсуждал покупку нового велосипеда! 🚲

# Demo.Contact2.Received.4
source: Haha, exactly! Stay online and don't miss your secret bike plan! 🚴‍♂️
ru: Ахаха, точно! Оставайся в сети и не упусти свой секретный велосипедный план! 🚴‍♂️

# Demo.Contact2.Own.4
source: Hmm, what if I forget to connect on time?
ru: Хм, а что если я забуду подключиться вовремя?

# Demo.Contact2.Received.5
source: Then secrets remain secrets! 😂
ru: Тогда секреты останутся секретами! 😂

# Demo.Contact3.Received.1
source: There's no identifying information in oChat at all! 😮
ru: В oChat вообще нет никакой идентификационной информации! 😮

# Demo.Contact3.Own.1
source: What do you mean?
ru: Что ты имеешь в виду?

# Demo.Contact3.Received.2
source: No names, no time, no dates – nothing. You are completely anonymous. It's like a secret masked gathering! 🎭
ru: Никаких имен, времени, дат – ничего. Ты полностью анонимен. Это как тайное собрание под масками! 🎭

# Demo.Contact3.Own.2
source: Hmm, that sounds intriguing. What if I forget who I'm talking to?
ru: Хм, это звучит любопытно. А если я забуду, с кем разговариваю?

# Demo.Contact3.Received.3
source: Well, you'll have to use your superhuman intellect to remember! 🧠
ru: Ну, тебе придется использовать свой сверхчеловеческий интеллект, чтобы вспомнить! 🧠

# Demo.Contact3.Own.3
source: Or just take notes. But anonymity is cool! 📓
ru: Ну или просто записывать в блокнот. Но анонимность – это круто! 📓

# Demo.Contact3.Received.4
source: Imagine you're a secret agent, and even your friends don't know who you are! 🕵️‍♂️
ru: Представь, что ты тайный агент, и даже твои друзья не знают, кто ты! 🕵️‍♂️

# Demo.Contact3.Own.4
source: I feel like a real spy! 😎
ru: Чувствую себя настоящим шпионом! 😎

# Demo.Contact4.Received.1
source: You know, oChat has a fake password feature. Heard about it?
ru: Знаешь, у oChat есть функция фейкового пароля. Слышал об этом?

# Demo.Contact4.Own.1
source: Interesting! What's it for?
ru: Интересно! А зачем это?

# Demo.Contact4.Received.2
source: If someone forces you to unlock the chat, you enter the fake password, and it shows fake data. 🎩
ru: Если кто-то заставляет тебя разблокировать чат, ты вводишь фейковый пароль, и он показывает поддельные данные. 🎩

# Demo.Contact4.Own.2
source: Wow! It's like having a backup story to mislead! Haha! 😂
ru: Ого! Это как иметь запасную историю для отвода глаз! Ха-ха! 😂

# Demo.Contact4.Received.3
source: Exactly! Like showing your collection of fake treasures! 🏴‍☠️
ru: Точно! Как будто ты показываешь свою коллекцию поддельных сокровищ! 🏴‍☠️

# Demo.Contact4.Own.3
source: It's like in the movies! Now I definitely want to try it! 🎬
ru: Это как в кино! Теперь я точно хочу попробовать! 🎬

# Demo.Contact4.Received.4
source: Imagine getting caught and entering the fake password. They think they know everything, but actually – nothing! 😆
ru: Представь, что тебя поймали, и ты вводишь фейковый пароль. Они думают, что все узнали, а на самом деле – ничего! 😆

# Demo.Contact4.Own.4
source: Genius! This will definitely come in handy! 🧠
ru: Гениально! Это точно пригодится! 🧠

# Demo.Contact5.Received.1
source: Guess what, you can't take screenshots in oChat! 📵
ru: Прикинь, в oChat невозможно сделать скриншоты! 📵

# Demo.Contact5.Own.1
source: Really? How did they manage that?
ru: Правда? А как они это сделали?

# Demo.Contact5.Received.2
source: They blocked the ability to take screenshots so no one can save the conversation. Very smart! 👏
ru: Они заблокировали возможность делать скрины, чтобы никто не мог сохранить переписку. Очень умно! 👏

# Demo.Contact5.Own.2
source: Now you can write anything, and no one will save the evidence! 😜
ru: Теперь можно писать что угодно, и никто не сохранит доказательства! 😜

# Demo.Contact5.Received.3
source: Exactly! Whether confessing love or sharing secrets – everything stays between us! 💖
ru: Точно! Хоть признайся в любви, хоть расскажи секреты – всё останется между нами! 💖

# Demo.Contact5.Own.3
source: Wow, that's convenient. I remember a friend taking a screenshot of my message and showing it to everyone. That won't happen again! 😅
ru: Ого, это удобно. Помню, как друг сделал скриншот моего сообщения и всем показал. Больше такого не повторится! 😅

# Demo.Contact6.Received.1
source: In oChat, you can prevent the other contact from saving our conversation
ru: В oChat можно запретить другому контакту сохранять нашу переписку

# Demo.Contact6.Own.1
source: Really? They just can't save it?
ru: И что, он просто не сможет её хранить?

# Demo.Contact6.Received.2
source: Yes! All messages are available only while both of us are online. After that, everything disappears like magic! 🧙‍♂️
ru: Да! Все сообщения доступны только пока мы оба в сети. После этого всё исчезает, как по волшебству! 🧙‍♂️

# Demo.Contact6.Own.2
source: It's like magic! 🔮
ru: Это как магия! 🔮

# Demo.Contact6.Received.3
source: Exactly! No traces, no evidence. Complete security! 🕵️‍♂️
ru: Точно! Никаких следов, никаких доказательств. Полная безопасность! 🕵️‍♂️

# Demo.Contact6.Own.3
source: This is just genius! Now I can be sure my messages won't fall into the wrong hands. 🔐
ru: Это просто гениально! Теперь я могу быть уверен, что мои сообщения не попадут не в те руки. 🔐

# Demo.Contact6.Received.4
source: Remember when a friend told you a secret and then said it's only for five minutes? It's the same here! 😂
ru: Помнишь, когда тебе друг рассказал секрет, а потом сказал, что это на 5 минут? Вот тут тоже самое! 😂

# Demo.Contact7.Received.1
source: In oChat, there's no limit on message size. 📝
ru: В oChat нет ограничений на размер сообщений. 📝

# Demo.Contact7.Own.1
source: Seriously? What if I want to send a novel? 😂
ru: Серьезно? А если я хочу отправить роман? 😂

# Demo.Contact7.Received.2
source: No problem! Send a whole book if you want, no one will stop you! 📚
ru: Без проблем! Отправляй хоть целую книгу, никто не остановит! 📚

# Demo.Contact7.Own.2
source: That's a service! Now I can write epic tales! 📖
ru: Вот это сервис! Теперь можно писать эпические рассказы! 📖

# Demo.Contact7.Received.3
source: Exactly! Write as much as you want. No limits! ✍️
ru: Точно! Пиши, сколько хочешь. Никаких ограничений! ✍️

# Demo.Contact7.Own.3
source: It's like long letters of old times, but digital! 📜
ru: Это как длинные письма в старину, только цифровые! 📜

# Demo.Contact7.Received.4
source: Yes, and no character limits! Write whatever you like! 😊
ru: Да, и никаких ограничений по количеству символов! Пиши, что душе угодно! 😊

# Demo.Contact8.Received.1
source: In oChat, there's no limit on file size. 🎥
ru: В oChat нет ограничений на размер файлов. 🎥

# Demo.Contact8.Own.1
source: So I can send even movies?
ru: Так можно отправить даже фильмы?

# Demo.Contact8.Received.2
source: Yes, even movies! 🎬
ru: Так можно отправить даже фильмы?

# Demo.Contact8.Own.2
source: Wow, that's very convenient! Now I can share big videos without problems.
ru: Ого, это очень удобно! Теперь можно делиться большими видео без проблем. 🎬

# Demo.Contact8.Received.3
source: Yes, and no limits on the number of files you can send! 🗂️
ru: Да, и никаких ограничений по количеству отправляемых файлов! 🗂️

# Demo.Contact8.Own.3
source: Imagine wanting to send an entire photo album – no problem! 📸
ru: Представь, что хочешь отправить целый фотоальбом – никаких проблем! 📸

# Demo.Contact8.Received.4
source: And you don't have to split videos into parts to send! 📽️
ru: И не надо разбивать видео на кусочки, чтобы отправить! 📽️

# Demo.Contact9.Received.1
source: In oChat, you can change your voice during calls and when sending audio! 🎙️
ru: А в oChat можно изменять голос при звонках и отправке аудио! 🎙️

# Demo.Contact9.Own.1
source: Really? Can I make my voice sound like a robot?
ru: Правда? Можно сделать голос робота?

# Demo.Contact9.Received.2
source: Yes, or even like a spy! Full anonymity! 🤖🕵️‍♂️
ru: Да, или даже голос шпиона! Полная анонимность! 🤖🕵️‍♂️

# Demo.Contact9.Own.2
source: This is super cool! I need to try it! 😄
ru: Это супер прикольно! Надо попробовать! 😄

# Demo.Contact9.Received.3
source: Yes, you can become anyone during the call. Very fun! 😆
ru: Да, можешь стать кем угодно на время звонка. Очень забавно! 😆

# Demo.Contact9.Own.3
source: This is what I call a chat with imagination! 🎭
ru: Вот это я понимаю – чат с фантазией! 🎭

# Demo.Contact9.Received.4
source: Imagine calling a friend and they don't recognize you because you're speaking in Darth Vader's voice! 😜
ru: Представь, что звонишь другу, а он тебя не узнает, потому что ты говоришь голосом Дарта Вейдера! 😜

# Demo.Contact9.Own.4
source: That would be epic! Let's try it right now! 😂
ru: Это будет эпично! Давай попробуем прямо сейчас! 😂

# Demo.Contact10.Received.1
source: Hi! Did you know you can turn off the typing indicator in oChat?
ru: Привет! Ты знал, что в oChat можно отключить индикатор ввода текста?

# Demo.Contact10.Own.1
source: Wow, how?
ru: Ого, это как?

# Demo.Contact10.Received.2
source: Just disable this feature, and your contact won't see that you're typing. No more 'Typing...'! 📝
ru: Просто отключаешь эту функцию, и твой собеседник не увидит, что ты печатаешь. Никаких Печатает... больше нет! 📝

# Demo.Contact10.Own.2
source: Hmm, convenient. Especially when you don't want the other person to know you're thinking about your response for a long time! 😂
ru: Хм, удобно. Особенно, когда не хочешь, чтобы другой знал, что ты долго думаешь над ответом! 😂

# Demo.Contact10.Received.3
source: Exactly! You can calmly think about your replies, and no one will know how long it takes. 🕰️
ru: Точно! Можно спокойно обдумывать свои ответы, и никто не будет знать, сколько времени это занимает. 🕰️

# Demo.Contact10.Own.3
source: This is a lifesaver for slow thinkers! Sometimes you're typing and then decide to write something completely different. 😅
ru: Это спасение для медлительных мыслителей! А то иногда печатаешь, а потом решаешь, что написать совсем другое. 😅

# Demo.Contact10.Received.4
source: Yes, no more nervous waiting! Just type as you like. 😎
ru: Да, никаких больше нервных ожиданий! Просто печатай, как тебе удобно. 😎

# Demo.Contact11.Received.1
source: Guess what, in oChat you can prevent the other person from saving photos and videos you send!
ru: Прикинь, в oChat можно запретить собеседнику сохранять фото и видео, которые ты отправляешь!

# Demo.Contact11.Own.1
source: Seriously? How does that work?
ru: Серьезно? А как это работает?

# Demo.Contact11.Received.2
source: Very simple! You set a restriction, and the other person can't save the sent media files to their device. 📷🚫
ru: Очень просто! Устанавливаешь запрет, и собеседник не сможет сохранить отправленные медиафайлы на своё устройство. 📷🚫

# Demo.Contact11.Own.2
source: That's very convenient! Now I can share personal photos without fear they'll end up elsewhere. 😊
ru: Это очень удобно! Теперь можно делиться личными фото без страха, что они попадут куда-то ещё. 😊

# Demo.Contact11.Received.3
source: Exactly! No more saved screenshots or videos. Everything stays in the chat. 🎥🔒
ru: Именно! Никаких больше сохранённых скриншотов или видео. Всё остаётся только в чате. 🎥🔒

# Demo.Contact11.Own.3
source: It's like sending photos in self-destruct mode, but without a timer! 🔥
ru: Это как отправка фото в режиме самоуничтожения, но без таймера! 🔥

# Demo.Contact11.Received.4
source: Exactly! Full security and control over your media files. 🛡️
ru: Точно! Полная безопасность и контроль над своими медиафайлами. 🛡️

# Demo.Contact11.Own.4
source: Now I can share the funniest moments without fearing they'll become public! 😂
ru: Теперь можно делиться самыми смешными моментами, не боясь, что они станут достоянием общественности! 😂
