Repository: V1taS/oChat
Catalog: oChat/App/Sources/Modules/Settings/PasscodeSettingsScreenModule/Localization/*.lproj/PasscodeSettingsScreenLocalization.strings
Languages: ru

# State.Header.Title
source: Privacy
ru: Конфиденциальность

# State.Passcode.Title
source: Lock oChat
ru: Заблокировать oChat

# State.Passcode.Description
source: Require code to unlock
ru: Требовать код для разблокировки

# State.ChangeAccessCode.Title
source: Change access code
ru: Изменить код доступа

# State.FakePasscode.Title
source: Fake access to oChat
ru: Фейковый доступ в oChat

# State.FakePasscode.Description
source: Fake code to open an empty chat
ru: Фейковый код для открытия пустого чата

# State.FakeChangeAccessCode.Title
source: Change fake code
ru: Изменить фейковый код

# State.TypingIndicator.Title
source: Typing Indicator
ru: Индикатор ввода текста

# State.TypingIndicator.Description
source: Shows when you are typing a message
ru: Показывает когда Вы набираете сообщение

# State.CanSaveMedia.Title
source: Save Media Files
ru: Сохранение медиафайлов

# State.CanSaveMedia.Description
source: Allow the interlocutor to save photos and videos
ru: Разрешить собеседнику сохранять фото и видео

# State.ChatHistory.Title
source: Chat History
ru: Истории переписки

# State.ChatHistory.Description
source: Allow the interlocutor to keep the chat history
ru: Разрешить хранить переписку собеседнику

# State.VoiceChanger.Title
source: Voice Changer
ru: Изменение голоса

# State.VoiceChanger.Description
source: Change your voice during audio calls
ru: Измените свой голос при аудиозвонках

# State.FakeSetAccess.Error.Title
source: It is necessary to enable the main password first
ru: Необходимо сначала включить основной пароль
