Repository: V1taS/oChat
Catalog: oChat/App/Sources/Modules/MessengerDialogScreenModule/Localization/*.lproj/MessengerDialogScreenLocalization.strings
Languages: ru

# State.Notification.MessageFailure
source: Something went wrong
ru: Что-то пошло не так

# Messenger.Initial.Header.Title
source: Start an Anonymous Chat
ru: Начните анонимный диалог

# Messenger.Initial.Header.Description
source: Use our features for maximum security and anonymity in communication. Only you and your contact can see the messages.
ru: Используйте наши возможности для максимальной безопасности и анонимности общения. Только вы и ваш собеседник видите сообщения.

# Messenger.Initial.Button.Title
source: Send Chat Request
ru: Отправить запрос на переписку

# Messenger.Initial.One.Title
source: Simplicity and Innovation
ru: Простота и инновации

# Messenger.Initial.One.Description
source: Add a user, and every message will be encrypted multiple times and transmitted directly through secure channels.
ru: Добавьте пользователя, и каждое сообщение будет многократно шифроваться и передаваться напрямую через защищённые каналы.

# Messenger.Initial.Two.Title
source: Flawless Security
ru: Безупречная безопасность

# Messenger.Initial.Two.Description
source: Our technologies ensure that your data is transmitted directly and remains anonymous, providing protection against interception.
ru: Наши технологии гарантируют, что ваши данные передаются напрямую и остаются анонимными, обеспечивая защиту от перехвата.

# Messenger.Initial.Three.Title
source: Absolute Confidentiality
ru: Абсолютная конфиденциальность

# Messenger.Initial.Three.Description
source: Messages are not stored on servers for even a second. Direct p2p connection guarantees that no one but you and your contact can read them.
ru: Сообщения не хранятся на серверах ни на секунду. Прямое p2p соединение гарантирует, что никто, кроме вас и вашего собеседника, не сможет их прочитать.

# Messenger.Initial.Note
source: Request sent successfully. We cannot know if the contact is online until they confirm the chat request. If the contact is offline, they will not receive the invitation. You can resend it later.
ru: Запрос отправлен успешно. Мы не можем узнать, в сети ли контакт, пока он не подтвердит запрос на переписку. Если контакт не в сети, он не получит приглашение. Вы сможете повторить отправку позже.

# Messenger.Initial.Request
source: Enter recipient's address
ru: Введите адрес получателя

# Messenger.Initial.Message
source: Enter message
ru: Введите сообщение

# Messenger.Request.Header.Title
source: Anonymous Chat Request
ru: Запрос на анонимный диалог

# Messenger.Request.Header.Description
source: You have received a chat request. Only you and the sender will see the messages.
ru: Вы получили запрос на общение. Ваши сообщения будут видеть только вы и отправитель.

# Messenger.Request.Button.Title
source: Accept Request
ru: Принять запрос

# Messenger.Request.Button.Cancel.Title
source: Decline Request
ru: Отклонить запрос

# Messenger.Request.One.Title
source: Simplicity and Protection
ru: Простота и защита

# Messenger.Request.One.Description
source: By accepting the request, you can start secure communication. Each message is encrypted and transmitted directly through secure channels.
ru: Приняв запрос, вы можете начать безопасное общение. Каждое сообщение шифруется и передаётся напрямую через защищённые каналы.

# Messenger.Request.Two.Title
source: Guaranteed Security
ru: Гарантированная безопасность

# Messenger.Request.Two.Description
source: Our technologies ensure that your data is transmitted directly and anonymously, protecting your messages from interception.
ru: Наши технологии обеспечивают передачу данных напрямую и анонимно, защищая ваши сообщения от перехвата.

# Messenger.Request.Three.Title
source: Complete Confidentiality
ru: Полная конфиденциальность

# Messenger.Request.Three.Description
source: Your messages will not be stored on servers. Direct p2p connection guarantees that no one but you and the sender can read them.
ru: Ваши сообщения не будут храниться на серверах. Прямое p2p соединение гарантирует, что никто, кроме вас и отправителя, не сможет их прочитать.

# Messenger.Message.SendRequest
source: Send Request
ru: Отправить запрос

# Messenger.Message.SendRequestIn
source: Send Request in
ru: Отправить запрос через

# Messenger.Message.seconds
source: sec.
ru: сек.

# Messenger.Message.Welcome.Sender
source: Congratulations! You have been successfully added to the contacts. Now wait for your new contact to message you.
ru: Поздравляем! Вас успешно добавили в контакты. Теперь дождитесь, когда ваш новый контакт вам напишет

# Messenger.Message.Welcome.Receiver
source: Congratulations! You have successfully added the contact. Please send a message first to start the chat.
ru: Поздравляем! Вы успешно добавили контакт. Пожалуйста, отправьте сообщение первым, чтобы начать общение

# Messenger.Typing.Title
source: Typing
ru: Печатает

# Messenger.ReceivingFile.Title
source: Receiving File
ru: Получение файла

# Messenger.FileTransfer.Title
source: File Transfer
ru: Передача файла

# Message.YouNotifiedContact.Title
source: You have notified your contact that you want to chat. Wait for them to appear in the chat.
ru: Вы уведомили вашего контакта, что вы хотите пообщаться. Ожидайте его появления в чате.

# Messenger.ContactDidNotEnableNotifications.Title
source: Contact did not enable notifications on the device
ru: Контакт не включил уведомления на устройстве

# Messenger.TextCopied.Title
source: Text Copied
ru: Текст скопирован

# Messenger.SavingError.Title
source: Saving Error
ru: Ошибка сохранения

# Messenger.VideoSavedToGallery.Title
source: Video Saved to Gallery
ru: Видео сохранено в галерее

# Messenger.ImageSavedToGallery.Title
source: Image Saved to Gallery
ru: Изображение сохранено в галерее
