Repository: V1taS/oChat
Catalog: oChat/App/Sources/Modules/AuthenticationScreenModule/Localization/*.lproj/AuthenticationScreenLocalization.strings
Languages: ru

# State.EnterPasscode.Title
source: Enter a new access code
ru: Введите новый код доступа

# State.EnterOldPasscode.Title
source: Enter the old access code
ru: Введите старый код доступа

# State.ReEnterPasscode.Title
source: Confirm your new access code
ru: Подтвердите ваш новый код доступа

# State.LoginPasscode.Title
source: Enter the access code
ru: Введите код доступа

# State.CreatePasscode.Success.Title
source: You have set a new access code
ru: Вы установили новый код доступа

# State.CreatePasscode.Failure.Title
source: Access code is not confirmed
ru: Код доступа не подтвержден

# State.LoginPasscode.Success.Title
source: Access code is confirmed
ru: Код доступа подтвержден

# State.LoginPasscode.Failure.Title
source: Access code is not confirmed
ru: Код доступа не подтвержден

# State.LoginPasscode.AllDataErased.Title
source: All data erased
ru: Все данные стерты

# State.ValidationCount.Failure.Title
source: The access code must consist of %@ digits
ru: Код доступа должен состоять из %@ цифр

# State.SimplePasswords.Failure.Title
source: The password is too simple
ru: Пароль слишком простой

# State.CreatePasscode.NotAvailable.Title
source: This password is not available
ru: Такой пароль недоступен
