Repository: V1taS/oChat
Catalog: LocalDependencies/MessengerSDK/Sources/MessengerSDK/Modules/MessengerDialogScreenModule/Localization/*.lproj/MessengerDialogScreenLocalization.strings
Languages: ru

# State.Notification.MessageFailure
source: Something went wrong
ru: Что-то пошло не так

# Messenger.Initial.Header.Title
source: Start an anonymous dialogue
ru: Начните анонимный диалог

# Messenger.Initial.Header.Description
source: Use the capabilities of Tox and TOR for maximum security and anonymity of communication. Only you and your interlocutor see messages.
ru: Используйте возможности Tox и TOR для максимальной безопасности и анонимности общения. Только вы и ваш собеседник видите сообщения.

# Messenger.Initial.Button.Title
source: Send a correspondence request
ru: Отправить запрос на переписку

# Messenger.Initial.One.Title
source: Simplicity and innovation
ru: Простота и инновации

# Messenger.Initial.One.Description
source: Simply add a user and each message will be encrypted multiple times and transmitted directly through secure channels.
ru: Просто добавьте пользователя, и каждое сообщение будет многократно шифроваться и передаваться напрямую через безопасные каналы.

# Messenger.Initial.Two.Title
source: Impeccable security
ru: Безупречная безопасность

# Messenger.Initial.Two.Description
source: The unique combination of Tox and TOR ensures that your data is transmitted directly and remains anonymous, providing unrivaled protection against interception.
ru: Уникальное сочетание Tox и TOR гарантирует, что ваши данные передаются напрямую и остаются анонимными, обеспечивая непревзойденную защиту от перехвата.

# Messenger.Initial.Three.Title
source: Absolute confidentiality
ru: Абсолютная конфиденциальность

# Messenger.Initial.Three.Description
source: Messages are not stored on servers for even a second. Direct p2p connection via Tox and TOR encryption ensure that no one except you and your interlocutor can read your messages.
ru: Сообщения не хранятся на серверах ни на секунду. Прямое p2p соединение через Tox и шифрование TOR гарантируют, что никто, кроме вас и вашего собеседника, не сможет прочитать ваши сообщения.

# Messenger.Initial.Note
source: The request was sent successfully. We can't tell if a contact is online until they confirm a message request. If a contact is offline, they won't receive an invitation. You can resend later.
ru: Запрос отправлен успешно. Мы не можем узнать, в сети ли контакт, пока он не подтвердит запрос на переписку. Если контакт не в сети, он не получит приглашение. Вы сможете повторить отправку позже.

# Messenger.Initial.Request
source: Enter recipient's address
ru: Введите адрес получателя

# Messenger.Initial.Message
source: Enter your message
ru: Введите сообщение

# Messenger.Request.Header.Title
source: Request for anonymous dialogue
ru: Запрос на анонимный диалог

# Messenger.Request.Header.Description
source: You have received a request to communicate via Tox and TOR. Only you and the sender will see your messages.
ru: Вы получили запрос на общение через Tox и TOR. Ваши сообщения будут видеть только вы и отправитель.

# Messenger.Request.Button.Title
source: Accept request
ru: Принять запрос

# Messenger.Request.Button.Cancel.Title
source: Reject request
ru: Отклонить запрос

# Messenger.Request.One.Title
source: Simplicity and protection
ru: Простота и защита

# Messenger.Request.One.Description
source: Once you accept the request, you can begin secure communication. Every message is encrypted and transmitted directly through secure channels.
ru: Приняв запрос, вы можете начать безопасное общение. Каждое сообщение шифруется и передается напрямую через защищенные каналы.

# Messenger.Request.Two.Title
source: Guaranteed safety
ru: Гарантированная безопасность

# Messenger.Request.Two.Description
source: Tox and TOR enable data transfer directly and anonymously, protecting your communications from interception.
ru: Tox и TOR обеспечивают передачу данных напрямую и анонимно, защищая ваши сообщения от перехвата.

# Messenger.Request.Three.Title
source: Complete confidentiality
ru: Полная конфиденциальность

# Messenger.Request.Three.Description
source: Your messages will not be stored on servers. Direct p2p connection via Tox and TOR encryption ensure that no one but you and the sender can read your messages.
ru: Ваши сообщения не будут храниться на серверах. Прямое p2p соединение через Tox и шифрование TOR гарантируют, что никто, кроме вас и отправителя, не сможет прочитать ваши сообщения.

# Messenger.Message.SendRequest
source: Send request
ru: Отправить запрос

# Messenger.Message.SendRequestIn
source: Send request in
ru: Отправить запрос через

# Messenger.Message.seconds
source: sec.
ru: сек.
